app/views/users/show.html.erb


        <% @user.posts.each do |post| %> <!-- ユーザーの投稿一覧-->
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 2]]