app/views/posts/show.html.erb

SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."post_id" = ? LIMIT ?  [["user_id", 1], ["post_id", 6], ["LIMIT", 1]]
---
                </div>
                <% if Like.find_by(user_id: @current_user.id, post_id: @post.id) %>

SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 3]]
---
                <% end %>
                <%= Like.where(post_id: @post.id).count %> <!-- いいねの数-->