app/controllers/application_controller.rb

    def set_current_user
        @current_user = User.find_by(id: session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]