app/controllers/posts_controller.rb

  def ensure_correct_user
    @post = Post.find_by(id: params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

  def index
    @posts = Post.all.order(created_at: :desc)
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC

  def create
    @post = Post.new(
      content: params[:content],
      user_id: @current_user.id
      )
    if @post.save
---
INSERT INTO "posts" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "おはよう"], ["created_at", "2021-11-09 02:58:37.396978"], ["updated_at", "2021-11-09 02:58:37.396978"], ["user_id", 1]]

  def show
    @post = Post.find_by(id: params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

  def edit
    @post = Post.find_by(id: params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def update
    @post = Post.find_by(id: params[:id])
    @post.content = params[:content]
    if @post.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "こんばんは。"], ["updated_at", "2022-01-06 12:54:34.451688"], ["id", 5]]

  def destroy
    @post = Post.find_by(id: params[:id])
    if @post.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 2]]