app/controllers/users_controller.rb

SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = ?  [["user_id", 1]]
---
  def likes
    @user = User.find_by(id: params[:id])
    @likes = Like.where(user_id: @user.id)