app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "user_image", "password_digest") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(
      name: params[:name],
      email: params[:email],
      user_image: "default_user.jpg",
      password: params[:password]
    )
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def edit
    @user = User.find_by(id: params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "user_image" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["user_image", "2.jpg"], ["updated_at", "2022-04-09 06:34:08.209334"], ["id", 2]]
---
  def update
    @user = User.find_by(id: params[:id])
    @user.name = params[:name]
    @user.email = params[:email]
    if params[:image]
    @user.user_image = "#{@user.id}.jpg"
    image = params[:image]
    File.binwrite("public/user_images/#{@user.user_image}", image.read)
    end
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 8]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 6]]
---
  def destroy
    @user = User.find_by(id: params[:id])
    if @user.destroy
      @user.delete_liked_posts

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "wanko@prog-8.com"], ["LIMIT", 1]]
---
  def login
    @user = User.find_by(email: params[:email])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = ? ORDER BY "likes"."created_at" DESC  [["user_id", 2]]
---
  def likes
    @user = User.find_by(id: params[:id])
    @likes = Like.where(user_id: @user.id).order(created_at: :desc)