app/models/user.rb

    def delete_all_posts
        posts = Post.where(user_id: self.id)
        posts.each do |post|
            post.destroy
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 6]]

   def delete_liked_posts
       posts = Post.where(user_id: self.id)
       likes = Like.where(post_id: posts.ids)
       likes.each do |like|
            like.destroy
---
SELECT "posts"."id" FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 3]]
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" IN (?, ?)  [["post_id", 16], ["post_id", 17]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 18]]